---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIntersection
source: html/6992f766-4683-589e-7777-417949bf3d1a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIntersection Property

A chain formed by these curve elements intersects other chain with the same grid orientation. Both chains will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainIntersection { get; }
```